app/controllers/lessons_controller.rb

  def index
    if !logged_in?
      redirect_to lesson_path(Lesson.first)
---
SELECT "lessons".* FROM "lessons"

  def create
    if !logged_in?
      redirect_to lesson_path(Lesson.first)
    end
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("created_at", "created_by", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-12-29 09:14:39.266337"], ["created_by", 1], ["description", "MyText"], ["title", "MyString"], ["updated_at", "2014-12-29 09:14:39.266337"]]

  def destroy
    @lesson.destroy
---
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 980190962]]

  def set_lesson
    @user = current_user
    @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons"  WHERE "lessons"."id" = ? LIMIT 1  [["id", 980190962]]